#!/usr/bin/env python
# encoding: utf-8
# @Time    : 2020/3/12 15:44
# @Author  : Lancer


stream_head =[
    [ '接口信息类型',2, 0xFFFF ],
    [ '发送方标识ID',4, 0xFFFFFFFF ],
    [ '接收方标识ID',4, 0xFFFFFFFF ],
    [ '电子地图CRC',4, 0xFFFFFFFF ],
    [ '本周期序列号',4, 0xFFFFFFFF ],
    [ '设备通讯周期',2, 0xFFFF ],
    [ '回复对方序列号',4, 0xFFFFFFFF ],
    [ '回复本方序列号',4, 0xFFFFFFFF ],
    [ '协议版本号',1, 0x00 ],
    [ '数据包总长度',2, 0xFFFF ],
]

stream_head_b2v_table = [
    [ '接口信息类型',2  ],
    [ 'sender_id',4  ],
    [ 'receiver_id',4  ],
    [ 'map_version_crc32',4   ],
    [ 'send_num',4, ],
    [ 'com_period',2  ],
    [ 'opposite_num',4 ],
    [ 'rcv_num',4 ],
    [ 'protocol_version',1 ],
    [ 'package_len',2 ],
]

app_head_b2v_table = [
    [ 'data_len',2  ],
    [ 'data_type',2 ],
]

b2v_dev_num8_table = [
    ["个数", 1]
]

b2v_dev_num16_table = [
    ["个数", 16]
]

####################  b2v table  CI ATS #########################

#心跳包
rec_ats_time_table = [
    ["年",1],
    ["月",1],
    ["日",1],
    ["时",1],
    ["分",1],
    ["秒",1],
]

b2v_ats_cmd_table = [
    ["命令类型",1],
    ["命令设备ID",4],
    ["设备类型",1],
    ["其他",1],
    ["客户端编号",4],
]

b2v_ats_cmd_back_table = [
    ["反馈命令类型",1],
    ["命令执行状态",1],
    ["反馈命令ID",4],
    ["计时参数",2],
    ["客户端编号",4],
]

b2v_ats_verify_cmd_bc_table = [
    ["安全命令类型",1],
    ["命令设备ID",4],
    ["设备类型",1],
    ["其他",1],
    ["安全命令确认结果",1],
    ["安全命令失败原因",1],
    ["客户端编号",4],
]

b2v_ats_sure_cmd_bc_table = [
    ["安全命令类型",1],
    ["命令设备ID",4],
    ["设备类型",1],
    ["其他",1],
    ["安全命令确认结果",1],
    ["安全命令失败原因",1],
    ["客户端编号",4],
]


ci_version_table = [
    ["CI软件版本号",4 ]
]

warn_type_dict = {
    0x01:"上电解锁状态",
    0x02:"联锁A系B系故障报警",
    0x03:"联锁与ZC通信故障",
    0x04:"联锁与临站联锁通信故障",
    0x05:"联锁与列车通信故障",
    0x06:"信号机灯丝断丝报警",
    0x07:"信号故障报警",
    0x08:"道岔故障报警",
    0x09:"道岔失去表示报警",
    0x0A:"信号机灯丝断丝报警",
    0x0B:"计轴区段异常占用报警",
    0x0C:"计轴区段异常空闲报警",
    0x0D:"联锁与EEOC通信故障",
    0x0E:"CI解析VOBC数据出错",
    0x0F:"CI解析ATS数据出错",
    0x10:"CI解析ZC数据出错",
    0x11:"紧急关闭按钮按下",
    0x12:"站台门旁路",
    0x14:"洗车机启动失败",
}

warn_type_num_table = [
    ["报警类型",1 ],
    ["报警数量",2 ],
]

id16bit_table = [
    ["设备ID", 2 ]
]

### 站场状态  bit
station_signal_table = [
    ["红色",1 ],
    ["黄色",1 ],
    ["绿色",1 ],
    ["白色",1 ],
    ["红黄色", 1],
    ["蓝色", 1],
    ["亮灭", 1],
    ["灯丝", 1],
    ["封锁", 1],
]

station_switch_table = [
    ["定位",1 ],
    ["左1",1 ],
    ["左2",1 ],
    ["右1",1 ],
    ["右2",1 ],
    ["四开", 1],
    ["故障", 1],
    ["单锁", 1],
    ["封锁", 1],
    ["控制权", 1],
]

station_track_table = [
    ["上电锁闭",1 ],
    ["进路锁闭",1 ],
    ["防护锁闭",1 ],
    ["故障锁闭",1 ],
    ["引导锁闭",1 ],
    ["占用状态", 1],
    ["封锁状态", 1],
]

station_ltrack_table = [
    ["ARB状态",1 ],
    ["通信车占用状态",1 ],
    ["非通信车占用状态",1 ],
]


station_route_table = [
    ["选排状态",1 ],
    ["延时解锁状态",1 ],
    ["锁闭状态",1 ],
]

station_auto_route_table = [
    ["自动通过",1 ],
]

station_psd_table = [
    ["互锁解除状态",1 ],
    ["屏蔽门开关状态",1 ],
]


station_esb_table = [
    ["按钮状态",1 ],
]

station_station_table = [
    ["车站扣车状态",1 ],
    ["中心扣车状态",1 ],
    ["IBP盘扣车状态",1 ],
]

station_type_num_table = [
    ["类型",1 ],
    ["数量",2 ],
]


station_dev_name_table = [
"信号机",
"道岔",
"物理区段",
"逻辑区段",
"进路",
"联锁自动通过进路",
"屏蔽门",
"紧急关闭按钮",
"扣车",
"自动折返返",
"全自动折返",
"SPKS按钮",
    "联锁自动触发进路",
    "清客确认按钮",
    "再关门按钮",
    "强制点灯状态",
    "洗车机状态",
    "充电弓状态",
    "非进路调车状态",
]


#################### end b2v table  CI ATS #########################
